tags/2.0.6/docs/internal/ExampleRequests.txt

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<GenerateMethods xmlns="http://schemas.cordys.com/1.0/SAPMethodPublish">
			<type>BAPI</type>
			<businessobject_mestype>Customer</businessobject_mestype>
			<interfacename>TestInterface</interfacename>
			<namespace>http://aa.com</namespace>
			<operations>
				<operation servicename="Create">BAPI_CUSTOMER_CREATE</operation>
				<operation servicename="CreateFromData">BAPI_CUSTOMER_CREATEFROMDATA</operation>
				<operation servicename="CreateFromData1">BAPI_CUSTOMER_CREATEFROMDATA1</operation>
			</operations>
		</GenerateMethods>
	</SOAP:Body>
</SOAP:Envelope>
